nxp-mcuxpresso/mcux-sdk/devices/MCXW716C/drivers/fsl_clock.h
    /* For SCG CLK intput */
    kCLOCK_ScgSysOscClk, /*!< SCG system OSC clock.                               */
    kCLOCK_ScgSircClk,   /*!< SCG SIRC clock.                                     */
    kCLOCK_ScgFircClk,   /*!< SCG FIRC clock.                                     */
    kCLOCK_RtcOscClk,    /*!< RTC OSC clock.                                      */
} clock_name_t;

/*!
 * @brief Clock source for peripherals that support various clock selections.
 *
 * These options are for MRCC->XX[CC]
 */
typedef enum _clock_ip_control
{
    kCLOCK_IpClkControl_fun0 = 0U, /*!< Peripheral clocks are disabled, module does not stall low power mode entry. */
    kCLOCK_IpClkControl_fun1 = 1U, /*!< Peripheral clocks are enabled, module does not stall low power mode entry. */
    kCLOCK_IpClkControl_fun2 = 2U, /*!< Peripherals clocks are enabled unless peripheral is idle, low power mode entry
                                      will stall until peripheral is idle. */
    kCLOCK_IpClkControl_fun3 =
        3U, /*!<  Peripheral clocks are enabled unless in SLEEP mode (or lower), low power mode entry will stall until
               peripheral is idle Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not
               stall low power mode entry unless entering DEEPSLEEP mode (or lower) */
} clock_ip_control_t;

/*!
 * @brief Clock source for peripherals that support various clock selections.
 *
 * These options are for MRCC->XX[MUX].
 */
typedef enum _clock_ip_src
{
    kCLOCK_IpSrcFro6M   = 2U, /*!< FRO 6M clock. */
    kCLOCK_IpSrcFro192M = 3U, /*!< FRO 192M clock. */
    kCLOCK_IpSrcSoscClk = 4U, /*!< OSC RF clock. */
    kCLOCK_IpSrc32kClk  = 5U, /*!< 32k Clk clock. */
} clock_ip_src_t;

/*!
 * @brief "IP Connector name difinition used for clock gate, clock source
 * and clock divider setting. It is defined as the corresponding register address.
 */
#define MAKE_MRCC_REGADDR(base, offset) ((base) + (offset))

#if defined(FSL_SDK_FORCE_CLK_DRIVER_NS_ACCESS) && FSL_SDK_FORCE_CLK_DRIVER_NS_ACCESS
#define CLOCK_REG(name) ((*(volatile uint32_t *)((uint32_t)(name) & ~0x10000000UL)))
#else
#define CLOCK_REG(name) (*(volatile uint32_t *)((uint32_t)(name)))
#endif

/*!
 * @brief Clock IP name.
 */
typedef enum _clock_ip_name
{
    kCLOCK_NOGATE          = 0U,                                  /*!< No clock gate for the IP in MRCC */
    kCLOCK_Ewm0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0x4C),  /*!< Clock ewm0 */
    kCLOCK_Syspm0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0x5C),  /*!< Clock syspm0 */
    kCLOCK_Wdog0           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x68),  /*!< Clock wdog0 */
    kCLOCK_Wdog1           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x6C),  /*!< Clock wdog1 */
    kCLOCK_Sfa0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0x74),  /*!< Clock sfa0 */
    kCLOCK_Crc0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0x8C),  /*!< Clock crc0 */
    kCLOCK_Secsubsys       = MAKE_MRCC_REGADDR(MRCC_BASE, 0x90),  /*!< Clock secsubsys */
    kCLOCK_Lpit0           = MAKE_MRCC_REGADDR(MRCC_BASE, 0xBC),  /*!< Clock lpit0 */
    kCLOCK_Tstmr0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0xC0),  /*!< Clock tstmr0 */
    kCLOCK_Tpm0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0xC4),  /*!< Clock tpm0 */
    kCLOCK_Tpm1            = MAKE_MRCC_REGADDR(MRCC_BASE, 0xC8),  /*!< Clock tpm1 */
    kCLOCK_Lpi2c0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0xCC),  /*!< Clock lpi2c0 */
    kCLOCK_Lpi2c1          = MAKE_MRCC_REGADDR(MRCC_BASE, 0xD0),  /*!< Clock lpi2c1 */
    kCLOCK_I3c0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0xD4),  /*!< Clock i3c */
    kCLOCK_Lpspi0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0xD8),  /*!< Clock lpspi0 */
    kCLOCK_Lpspi1          = MAKE_MRCC_REGADDR(MRCC_BASE, 0xDC),  /*!< Clock lpspi1 */
    kCLOCK_Lpuart0         = MAKE_MRCC_REGADDR(MRCC_BASE, 0xE0),  /*!< Clock lpuart0 */
    kCLOCK_Lpuart1         = MAKE_MRCC_REGADDR(MRCC_BASE, 0xE4),  /*!< Clock lpuart1 */
    kCLOCK_Flexio0         = MAKE_MRCC_REGADDR(MRCC_BASE, 0xE8),  /*!< Clock Flexio0 */
    kCLOCK_Can0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0xEC),  /*!< Clock Can0 */
    kCLOCK_Sema0           = MAKE_MRCC_REGADDR(MRCC_BASE, 0xFC),  /*!< Clock Sema0 */
    kCLOCK_Data_stream_2p4 = MAKE_MRCC_REGADDR(MRCC_BASE, 0x104), /*!< Clock data_stream_2p4 */
    kCLOCK_PortA           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x108), /*!< Clock portA */
    kCLOCK_PortB           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x10C), /*!< Clock portB */
    kCLOCK_PortC           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x110), /*!< Clock portC */
    kCLOCK_Lpadc0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0x11C), /*!< Clock lpadc0 */
    kCLOCK_Lpcmp0          = MAKE_MRCC_REGADDR(MRCC_BASE, 0x120), /*!< Clock lpcmp0 */
    kCLOCK_Lpcmp1          = MAKE_MRCC_REGADDR(MRCC_BASE, 0x124), /*!< Clock lpcmp1 */
    kCLOCK_Vref0           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x128), /*!< Clock verf0 */
    kCLOCK_Mtr_master      = MAKE_MRCC_REGADDR(MRCC_BASE, 0x134), /*!< Clock mtr_master */
    kCLOCK_GpioA           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x404), /*!< Clock gpioA */
    kCLOCK_GpioB           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x408), /*!< Clock gpioB */
    kCLOCK_GpioC           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x40C), /*!< Clock gpioC */
    kCLOCK_Dma0            = MAKE_MRCC_REGADDR(MRCC_BASE, 0x410), /*!< Clock dma0 */
    kCLOCK_Pflexnvm        = MAKE_MRCC_REGADDR(MRCC_BASE, 0x414), /*!< Clock pflexnvm */
    kCLOCK_Sram0           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x41C), /*!< Clock Sram0 */
    kCLOCK_Sram1           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x420), /*!< Clock Sram1 */
    kCLOCK_Sram2           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x424), /*!< Clock Sram2 */
    kCLOCK_Sram3           = MAKE_MRCC_REGADDR(MRCC_BASE, 0x428), /*!< Clock Sram3 */
    kCLOCK_Rf_2p4ghz_bist  = MAKE_MRCC_REGADDR(MRCC_BASE, 0x42C), /*!< Clock rf_2p4ghz_bist */
} clock_ip_name_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief SCG system clock type.
 */
typedef enum _scg_sys_clk
{
    kSCG_SysClkSlow,     /*!< System slow clock. */
    kSCG_SysClkBus,      /*!< Bus clock.         */
    kSCG_SysClkPlatform, /*!< Platform clock.    */
    kSCG_SysClkCore,     /*!< Core clock.        */
} scg_sys_clk_t;

/*!
 * @brief SCG system clock source.
 */
typedef enum _scg_sys_clk_src
{
    kSCG_SysClkSrcSysOsc = 1U, /*!< System OSC. */
    kSCG_SysClkSrcSirc   = 2U, /*!< Slow IRC.   */
    kSCG_SysClkSrcFirc   = 3U, /*!< Fast IRC.   */
    kSCG_SysClkSrcRosc   = 4U, /*!< RTC OSC. */
} scg_sys_clk_src_t;

/*!
 * @brief SCG system clock divider value.
 */
typedef enum _scg_sys_clk_div
{
    kSCG_SysClkDivBy1  = 0U,  /*!< Divided by 1.  */
    kSCG_SysClkDivBy2  = 1U,  /*!< Divided by 2.  */
    kSCG_SysClkDivBy3  = 2U,  /*!< Divided by 3.  */
    kSCG_SysClkDivBy4  = 3U,  /*!< Divided by 4.  */
    kSCG_SysClkDivBy5  = 4U,  /*!< Divided by 5.  */
    kSCG_SysClkDivBy6  = 5U,  /*!< Divided by 6.  */
    kSCG_SysClkDivBy7  = 6U,  /*!< Divided by 7.  */
    kSCG_SysClkDivBy8  = 7U,  /*!< Divided by 8.  */
    kSCG_SysClkDivBy9  = 8U,  /*!< Divided by 9.  */
    kSCG_SysClkDivBy10 = 9U,  /*!< Divided by 10. */
    kSCG_SysClkDivBy11 = 10U, /*!< Divided by 11. */
    kSCG_SysClkDivBy12 = 11U, /*!< Divided by 12. */
    kSCG_SysClkDivBy13 = 12U, /*!< Divided by 13. */
    kSCG_SysClkDivBy14 = 13U, /*!< Divided by 14. */
    kSCG_SysClkDivBy15 = 14U, /*!< Divided by 15. */
    kSCG_SysClkDivBy16 = 15U  /*!< Divided by 16. */
} scg_sys_clk_div_t;

/*!
 * @brief SCG system clock configuration.
 */
typedef struct _scg_sys_clk_config
{
    uint32_t divSlow : 4; /*!< Slow clock divider, see @ref scg_sys_clk_div_t. */
    uint32_t divBus : 4;  /*!< Bus clock divider, see @ref scg_sys_clk_div_t.  */
    uint32_t : 8;         /*!< Reserved. */
    uint32_t divCore : 4; /*!< Core clock divider, see @ref scg_sys_clk_div_t. */
    uint32_t : 4;         /*!< Reserved. */
    uint32_t src : 3;     /*!< System clock source, see @ref scg_sys_clk_src_t. */
    uint32_t : 5;         /*!< reserved. */
} scg_sys_clk_config_t;

/*!
 * @brief SCG clock out configuration (CLKOUTSEL).
 */
typedef enum _clock_clkout_src
{
    kClockClkoutSelScgSlow   = 0U, /*!< SCG Slow clock. */
    kClockClkoutSelSosc      = 1U, /*!< System OSC.     */
    kClockClkoutSelSirc      = 2U, /*!< Slow IRC.       */
    kClockClkoutSelFirc      = 3U, /*!< Fast IRC.       */
    kClockClkoutSelScgRtcOsc = 4U, /*!< SCG RTC OSC clock. */
} clock_clkout_src_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                      /*!< Monitor disabled. */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK, /*!< Interrupt when the SOSC error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the SOSC error is detected.     */
} scg_sosc_monitor_mode_t;

/*! @brief SOSC enable mode. */
enum
{
    kSCG_SoscDisable       = 0,                         /*!< Disable SOSC clock.             */
    kSCG_SoscEnable        = SCG_SOSCCSR_SOSCEN_MASK,   /*!< Enable SOSC clock.              */
    kSCG_SoscEnableInSleep = SCG_SOSCCSR_SOSCSTEN_MASK, /*!< Enable SOSC in sleep mode.      */
};

/*!
 * @brief SCG system OSC configuration.
 */
typedef struct _scg_sosc_config
{
    uint32_t freq;                       /*!< System OSC frequency. */
    uint32_t enableMode;                 /*!< Enable mode, OR'ed value of _scg_sosc_enable_mode.  */
    scg_sosc_monitor_mode_t monitorMode; /*!< Clock monitor mode selected.     */
} scg_sosc_config_t;

/*!
 * @brief SCG ROSC monitor mode.
 */
typedef enum _scg_rosc_monitor_mode
{
    kSCG_RoscMonitorDisable = 0U,                      /*!< Monitor disabled. */
    kSCG_RoscMonitorInt     = SCG_ROSCCSR_ROSCCM_MASK, /*!< Interrupt when the RTC OSC error is detected. */
    kSCG_RoscMonitorReset =
        SCG_ROSCCSR_ROSCCM_MASK | SCG_ROSCCSR_ROSCCMRE_MASK /*!< Reset when the RTC OSC error is detected. */
} scg_rosc_monitor_mode_t;

/*!
 * @brief SCG ROSC configuration.
 */
typedef struct _scg_rosc_config
{
    scg_rosc_monitor_mode_t monitorMode; /*!< Clock monitor mode selected.     */
} scg_rosc_config_t;

/*! @brief SIRC enable mode. */
typedef enum _scg_sirc_enable_mode
{
    kSCG_SircDisableInSleep = 0,                         /*!< Disable SIRC clock.             */
    kSCG_SircEnableInSleep  = SCG_SIRCCSR_SIRCSTEN_MASK, /*!< Enable SIRC in sleep mode.      */
} scg_sirc_enable_mode_t;

/*!
 * @brief SCG slow IRC clock configuration.
 */
typedef struct _scg_sirc_config
{
    scg_sirc_enable_mode_t enableMode; /*!< Enable mode, OR'ed value of _scg_sirc_enable_mode. */
} scg_sirc_config_t;

/*!
 * @brief SCG fast IRC trim mode.
 */
typedef enum _scg_firc_trim_mode
{
    kSCG_FircTrimNonUpdate = SCG_FIRCCSR_FIRCTREN_MASK,
    /*!< FIRC trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref scg_firc_trim_config_t.*/

    kSCG_FircTrimUpdate = SCG_FIRCCSR_FIRCTREN_MASK | SCG_FIRCCSR_FIRCTRUP_MASK
    /*!< FIRC trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} scg_firc_trim_mode_t;

/*!
 * @brief SCG fast IRC trim source.
 */
typedef enum _scg_firc_trim_src
{
    kSCG_FircTrimSrcSysOsc = 2U, /*!< System OSC.                 */
    kSCG_FircTrimSrcRtcOsc = 3U, /*!< RTC OSC (32.768 kHz).       */
} scg_firc_trim_src_t;

/*!
 * @brief SCG fast IRC clock trim configuration.
 */
typedef struct _scg_firc_trim_config
{
    scg_firc_trim_mode_t trimMode; /*!< FIRC trim mode.                       */
    scg_firc_trim_src_t trimSrc;   /*!< Trim source.                          */
    uint16_t trimDiv;              /*!< Divider of SOSC for FIRC.             */

    uint8_t trimCoar; /*!< Trim coarse value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
    uint8_t trimFine; /*!< Trim fine value; Irrelevant if trimMode is kSCG_FircTrimUpdate. */
} scg_firc_trim_config_t;

/*! @brief FIRC enable mode. */
enum
{
    kSCG_FircDisable       = 0,                         /*!< Disable FIRC clock.             */
    kSCG_FircEnable        = SCG_FIRCCSR_FIRCEN_MASK,   /*!< Enable FIRC clock.              */
    kSCG_FircEnableInSleep = SCG_FIRCCSR_FIRCSTEN_MASK, /*!< Enable FIRC in sleep mode.      */
};

/*!
 * @brief SCG fast IRC clock frequency range.
 */
typedef enum _scg_firc_range
{
    kSCG_FircRange48M,  /*!< Fast IRC is trimmed to 48 MHz. */
    kSCG_FircRange64M,  /*!< Fast IRC is trimmed to 64 MHz. */
    kSCG_FircRange96M,  /*!< Fast IRC is trimmed to 96 MHz. */
    kSCG_FircRange192M, /*!< Fast IRC is trimmed to 192 MHz. */
} scg_firc_range_t;

/*!
 * @brief SCG fast IRC clock configuration.
 */
typedef struct _scg_firc_config_t
{
    uint32_t enableMode;    /*!< Enable mode. */
    scg_firc_range_t range; /*!< Fast IRC frequency range. */

    const scg_firc_trim_config_t *trimConfig; /*!< Pointer to the FIRC trim configuration; set NULL to disable trim. */
} scg_firc_config_t;

/*!
 * @brief FRO192M RF clock frequency range.
 */
typedef enum _fro192m_rf_range
{
    kFro192M_Range16M, /*!< FRO192M output frequenc 16 MHz. */
    kFro192M_Range24M, /*!< FRO192M output frequenc 24 MHz. */
    kFro192M_Range32M, /*!< FRO192M output frequenc 32 MHz. */
    kFro192M_Range48M, /*!< FRO192M output frequenc 48 MHz. */
    kFro192M_Range64M, /*!< FRO192M output frequenc 64 MHz. */
} fro192m_rf_range_t;

/*!
 * @brief RF Flash APB and RF_CMC clock divide.
 */
typedef enum _fro192m_rf_clk_div
{
    kFro192M_ClkDivBy1 = 0U, /*!< Divided by 1. */
    kFro192M_ClkDivBy2 = 1U, /*!< Divided by 2. */
    kFro192M_ClkDivBy4 = 2U, /*!< Divided by 4. */
    kFro192M_ClkDivBy8 = 3U, /*!< Divided by 8. */
} fro192m_rf_clk_div_t;

/*!
 * @brief FRO192M RF clock configuration.
 */
typedef struct _fro192m_rf_clk_config
{
    fro192m_rf_range_t range;           /*!< FRO192M RF clock frequency range. */
    fro192m_rf_clk_div_t apb_rfcmc_div; /*!< RF Flash APB and RF_CMC clock divide. */
} fro192m_rf_clk_config_t;

